RSN/src/InformationRegisters/НастройкиИБИОбменов/НастройкиИБИОбменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИБИОбменов</name>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПараметрыЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Обмен</name>
    <type>
      <types>CatalogRef.ОбменыДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БазаДанныхДляОбмена</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/ОчередьОбработкиДанных/ОчередьОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОбработкиДанных</name>
  <resources>
    <name>Результат</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ПараметрыОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыСтруктура</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяИнициации</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбменДанных</name>
    <type>
      <types>CatalogRef.ОбменыДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ОбъектыМетаданныхИнформационныхБаз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/РезультатыОбработкиДанных/РезультатыОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыОбработкиДанных</name>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ОбработчикРезультата</name>
    <type>
      <types>CatalogRef.ОбработчикиРезультатовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяИнициации</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/Оповещения/Оповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Оповещения</name>
  <resources>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Вложение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеВложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяИнициации</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/Catalogs/ОбменыДанных/ОбменыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбменыДанных</name>
  <predefined>
    <items>
      <name>РезультатыОбменаБазДанных</name>
      <description>Результаты обмена баз дан</description>
    </items>
  </predefined>
  <attributes>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ОбъектыМетаданныхИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентноеЗадание</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикРезультата</name>
    <type>
      <types>CatalogRef.ОбработчикиРезультатовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиРассылки</name>
    <type>
      <types>CatalogRef.НастройкиРассылки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОчищатьОчередь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьСписокБаз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АдресаРассылок</name>
    <attributes>
      <name>ЭлектронныйАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоОшибки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RSN/src/CommonModules/ОбработкаДанных/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗарегистрироватьВОчереди(ОбменДанных, ДопПараметры, ПараметрыБлокировки = Неопределено, КодЯзыка = "") Экспорт   
	                      	
	ПараметрыПостановкиВОчередь = НовыйПараметрыПостановкиВОчередь();
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыПостановкиВОчередь, ДопПараметры, Истина);   
	
	ПараметрыБлокировки = Новый Структура("Идентификатор,ВремяИнициации", ПараметрыПостановкиВОчередь.Идентификатор, ПараметрыПостановкиВОчередь.ВремяИнициации);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменыДанных.Ссылка КАК ОбменДанных,
		|	ОбменыДанных.ОбъектМетаданных КАК ОбъектМетаданных,
		|	НастройкиИБИОбменов.БазаДанныхДляОбмена КАК ИнформационнаяБаза,
		|	&Идентификатор КАК Идентификатор,
		|	&ВремяИнициации КАК ВремяИнициации,
		|	ВЫБОР
		|		КОГДА НЕ (ВЫРАЗИТЬ(НастройкиИБИОбменов.ПараметрыЗапроса КАК СТРОКА(100))) = """"
		|			ТОГДА НастройкиИБИОбменов.ПараметрыЗапроса
		|		ИНАЧЕ &ПараметрыОбработки
		|	КОНЕЦ КАК ПараметрыОбработки,
		|	&Получатели КАК Получатели
		|ИЗ
		|	РегистрСведений.НастройкиИБИОбменов КАК НастройкиИБИОбменов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбменыДанных КАК ОбменыДанных
		|		ПО НастройкиИБИОбменов.Обмен = ОбменыДанных.Ссылка
		|ГДЕ
		|	НастройкиИБИОбменов.Актуальность
		|	И ОбменыДанных.Ссылка = &ОбменДанных";
	
	Запрос.УстановитьПараметр("ОбменДанных", ОбменДанных);
    Запрос.УстановитьПараметр("ПараметрыОбработки", ПараметрыПостановкиВОчередь.ПараметрыОбработки);
	Запрос.УстановитьПараметр("Идентификатор", ПараметрыПостановкиВОчередь.Идентификатор);
	Запрос.УстановитьПараметр("ВремяИнициации", ПараметрыПостановкиВОчередь.ВремяИнициации);
	Запрос.УстановитьПараметр("Получатели", ПараметрыПостановкиВОчередь.Получатели);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить(); 	
	Выборка = РезультатЗапроса.Выбрать();
	
	Попытка
		НачатьТранзакцию();		
		
		Пока Выборка.Следующий() Цикл 		
			ОчередьОбработкиДанных = РегистрыСведений.ОчередьОбработкиДанных.СоздатьМенеджерЗаписи();	 
			ЗаполнитьЗначенияСвойств(ОчередьОбработкиДанных, Выборка);  
			//+
			Если ДопПараметры.Свойство("ДопПараметрыЗадания") Тогда
				ОчередьОбработкиДанных.ПараметрыСтруктура = Новый ХранилищеЗначения(ДопПараметры.ДопПараметрыЗадания, Новый СжатиеДанных(9));
			КонецЕсли;
			//-
			ОчередьОбработкиДанных.Записать();
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();  
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ПараметрыЖурнала = ПараметрыЖурнала(ОбменДанных); 	
		ЗаписьЖурналаРегистрации(ПараметрыЖурнала.ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, 
					ПараметрыЖурнала.Метаданные, ПараметрыЖурнала.Данные, ТекстОшибки);
		
		ВызватьИсключение НСтр("ru='Не удалось зарегистрировать очередь обработки данных. Подробности см. в Журнале регистрации.'
							|;en='Failed to register a data processing queue.'", КодЯзыка);
	КонецПопытки; 
	
КонецПроцедуры

Функция НовыйПараметрыПостановкиВОчередь() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Идентификатор", Новый УникальныйИдентификатор);
	Параметры.Вставить("ВремяИнициации", ТекущаяДата());
	Параметры.Вставить("ПараметрыОбработки", "");
	Параметры.Вставить("Получатели", ""); 
	
	Возврат Параметры;
	
КонецФункции	
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РегламентныеЗадания

Процедура ЗапуститьОбработчикДанных(Обработчик, ДопПараметры) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ЗапускОбработчиковДанных);
	
	ИдентификаторыТекущегоОбработчика = Неопределено;
	ЗарегистрироватьВОчереди(Обработчик, ДопПараметры, ИдентификаторыТекущегоОбработчика);  
	ОбработатьОчередь(ИдентификаторыТекущегоОбработчика);
		
КонецПроцедуры 

Процедура ОчиститьРезультатыОбработчиков() Экспорт   
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОчисткаРезультатовОбработчиковДанных);
	
	ВремяИнициации = НачалоДня(ТекущаяДата()) - 86400;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьОбработкиДанных.Идентификатор КАК Идентификатор,
		|	ОчередьОбработкиДанных.ВремяИнициации КАК ВремяИнициации,
		|	ОчередьОбработкиДанных.ОбменДанных КАК ОбменДанных,
		|	ОчередьОбработкиДанных.ОбъектМетаданных КАК ОбъектМетаданных,
		|	ОчередьОбработкиДанных.ИнформационнаяБаза КАК ИнформационнаяБаза
		|ИЗ
		|	РегистрСведений.ОчередьОбработкиДанных КАК ОчередьОбработкиДанных
		|ГДЕ
		|	ОчередьОбработкиДанных.ВремяИнициации < &ВремяИнициации";
	
	Запрос.УстановитьПараметр("ВремяИнициации", ВремяИнициации);
	
	Выборка = Запрос.Выполнить().Выбрать();   
	Пока Выборка.Следующий() Цикл   
		УдалитьЗаписьИзРегистра(РегистрыСведений.ОчередьОбработкиДанных.СоздатьМенеджерЗаписи(), Выборка); 				
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезультатыОбработкиДанных.Идентификатор КАК Идентификатор,
		|	РезультатыОбработкиДанных.ВремяИнициации КАК ВремяИнициации
		|ИЗ
		|	РегистрСведений.РезультатыОбработкиДанных КАК РезультатыОбработкиДанных
		|ГДЕ
		|	РезультатыОбработкиДанных.ВремяИнициации < &ВремяИнициации";
	
	Запрос.УстановитьПараметр("ВремяИнициации", ВремяИнициации);
	
	Выборка = Запрос.Выполнить().Выбрать();   
	Пока Выборка.Следующий() Цикл   
		УдалитьЗаписьИзРегистра(РегистрыСведений.РезультатыОбработкиДанных.СоздатьМенеджерЗаписи(), Выборка);		
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Оповещения.Идентификатор КАК Идентификатор,
		|	Оповещения.ВремяИнициации КАК ВремяИнициации
		|ИЗ
		|	РегистрСведений.Оповещения КАК Оповещения
		|ГДЕ
		|	Оповещения.ВремяИнициации < &ВремяИнициации";
	
	Запрос.УстановитьПараметр("ВремяИнициации", ВремяИнициации);
	
	Выборка = Запрос.Выполнить().Выбрать();   
	Пока Выборка.Следующий() Цикл   
		УдалитьЗаписьИзРегистра(РегистрыСведений.Оповещения.СоздатьМенеджерЗаписи(), Выборка);		
	КонецЦикла; 	
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьСистемноеПодключение() Экспорт
	Настройки = Новый Структура("Логин,Пароль"); 
	Настройки.Логин = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("CDM_USER", "Логин");
	Настройки.Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("CDM_USER", "Пароль");
	
	Возврат Настройки;
КонецФункции

Процедура ОбработатьОчередь(ИдентификаторыОбработчика) Экспорт     
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки 					= ПолучитьСистемноеПодключение();
	СистемнаяАутентификация 	= Новый Структура("Аутентификация", Новый Структура("Пользователь, Пароль", Настройки.Логин, Настройки.Пароль));

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьОбработкиДанных.Идентификатор КАК Идентификатор,
		|	ОчередьОбработкиДанных.ВремяИнициации КАК ВремяИнициации,
		|	ОчередьОбработкиДанных.ПараметрыОбработки КАК ПараметрыОбработки,
		|	ОчередьОбработкиДанных.ИнформационнаяБаза.ПутьНаВебСервере + ""/hs/um/"" + ОчередьОбработкиДанных.ОбъектМетаданных.Владелец.Код + ""/"" + ОчередьОбработкиДанных.ОбъектМетаданных.ПредставлениеВСервисе КАК СтрокаПодключения,
		|	ОчередьОбработкиДанных.ОбменДанных КАК ОбменДанных,
		|	ОчередьОбработкиДанных.ОбменДанных.ОчищатьОчередь КАК ОчищатьОчередь,
		|	ОчередьОбработкиДанных.ОбъектМетаданных КАК ОбъектМетаданных,
		|	ОчередьОбработкиДанных.ИнформационнаяБаза КАК ИнформационнаяБаза,
		|	ОчередьОбработкиДанных.ИнформационнаяБаза.Конфигурация КАК Конфигурация,
		|	ОчередьОбработкиДанных.ПараметрыСтруктура КАК ПараметрыСтруктура
		|ИЗ
		|	РегистрСведений.ОчередьОбработкиДанных КАК ОчередьОбработкиДанных
		|ГДЕ
		|	ОчередьОбработкиДанных.Идентификатор = &Идентификатор
		|	И ОчередьОбработкиДанных.ВремяИнициации = &ВремяИнициации"; 
	
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторыОбработчика.Идентификатор);
	Запрос.УстановитьПараметр("ВремяИнициации", ИдентификаторыОбработчика.ВремяИнициации);
	Если ИдентификаторыОбработчика.Свойство("ИнформационнаяБаза") Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + "И ОчередьОбработкиДанных.ИнформационнаяБаза = &ИнформационнаяБаза"; 
		Запрос.УстановитьПараметр("ИнформационнаяБаза", ИдентификаторыОбработчика.ИнформационнаяБаза);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать(); 
	Пока Выборка.Следующий() Цикл     
		Попытка                     
			
			ПараметрыЗапроса = Неопределено;
			Если ЗначениеЗаполнено(Выборка.ПараметрыОбработки) Тогда
				ПараметрыЗапроса = ПрочитатьЗначениеJSON(Выборка.ПараметрыОбработки);	
			КонецЕсли;
			
			//+
			Аутентификация = СистемнаяАутентификация; 
			ДопПараметрыЗадания = Выборка.ПараметрыСтруктура.Получить();
			Если ДопПараметрыЗадания = Неопределено = Ложь Тогда 
				Если ДопПараметрыЗадания.Свойство("ПараметрыПодключения") Тогда
					ПараметрыПодключения = ДопПараметрыЗадания.ПараметрыПодключения;
					
					ТекПодключение = ПараметрыПодключения.Получить(Выборка.Конфигурация);
					Если ТекПодключение = Неопределено Тогда 
						ТекПодключение = ПараметрыПодключения.Получить(ПредопределенноеЗначение("Перечисление.КонфигурацииИнформационныхБаз.ПустаяСсылка"));
						Если ТекПодключение = Неопределено = Ложь Тогда 
							Аутентификация = Новый Структура("Аутентификация", Новый Структура("Пользователь, Пароль", ТекПодключение[0].ИмяПользователя, ТекПодключение[0].Пароль));
						КонецЕсли;
					Иначе  
						Аутентификация = Новый Структура("Аутентификация", Новый Структура("Пользователь, Пароль", ТекПодключение[0].ИмяПользователя, ТекПодключение[0].Пароль));
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
			//-		
			Ответ = КоннекторHTTP.GetJson(Выборка.СтрокаПодключения, ПараметрыЗапроса, Аутентификация); 
					
			ТекстОшибки = "";
			Если ТипЗнч(Ответ) = Тип("Структура") Тогда
				Если Ответ.Свойство("error") И Ответ.error Тогда    
					ТекстОшибки = Ответ.message;
				КонецЕсли;
			КонецЕсли; 
			
			Если ТекстОшибки = "" Тогда
				ЗаписатьРезультат(Выборка, ЗаписатьЗначениеJSON(Ответ), Ложь);
			Иначе
				ЗаписатьРезультат(Выборка, ТекстОшибки, Истина);
			КонецЕсли;
			
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
			ЗаписатьРезультат(Выборка, ТекстОшибки, Истина);
			
			ПараметрыЖурнала = ПараметрыЖурнала(Выборка.ОбменДанных); 	
			ЗаписьЖурналаРегистрации(ПараметрыЖурнала.ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, 
						ПараметрыЖурнала.Метаданные, ПараметрыЖурнала.Данные, ТекстОшибки);
		КонецПопытки;
	КонецЦикла; 
		
КонецПроцедуры

Функция ПараметрыЖурнала(ОбменДанных = Неопределено) Экспорт
	
	ПараметрыЖурнала = Новый Структура;
	ПараметрыЖурнала.Вставить("ИмяСобытия", НСтр("ru = 'Исполнение обработчика данных.'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ПараметрыЖурнала.Вставить("Данные", ОбменДанных);
	ПараметрыЖурнала.Вставить("Метаданные", ?(ОбменДанных <> Неопределено, ОбменДанных.Метаданные(), Неопределено));
	Возврат ПараметрыЖурнала;
	
КонецФункции 

Процедура ЗаписатьРезультат(Выборка, Результат, ЕстьОшибки)
	
	РегистрыСведений.ОчередьОбработкиДанных.ЗафиксироватьРезультатОбработкиОчереди(Выборка, Результат, ЕстьОшибки);
			
КонецПроцедуры

Процедура УдалитьЗаписьИзРегистра(МенеджерРегистра, ПараметрыЗаписи)
	
	ЗаполнитьЗначенияСвойств(МенеджерРегистра, ПараметрыЗаписи);
	МенеджерРегистра.Прочитать();
	Если МенеджерРегистра.Выбран() Тогда
		МенеджерРегистра.Удалить();	
	КонецЕсли;	
	
КонецПроцедуры	
	
#КонецОбласти
